In [1]:
import pandas as pd
import numpy as np

In [2]:
# Converted input to csv and read it
df = pd.read_csv('aoc_input.csv')
df.head()

   series_1  series_2
0     99006     28305
1     38540     91683
2     18133     49738
3     70780     13081
4     38316     55879

In [3]:
# Sorting the columns with numpy
df = pd.DataFrame(np.sort(df.values, axis=0), index=df.index, columns=df.columns)
df.head()

   series_1  series_2
0     10055     10568
1     10069     10743
2     10158     11109
3     10237     11134
4     10354     11428

In [4]:
# Enhance the date frame about the absolute difference column - in case it is needed later
df['difference'] = pd.Series.abs(df['series_1'] - df['series_2'])
df.head()

   series_1  series_2  difference
0     10055     10568         513
1     10069     10743         674
2     10158     11109         951
3     10237     11134         897
4     10354     11428        1074

In [5]:
# Solution for part 1
print(df['difference'].sum())

3508942

In [6]:
# Enhance the date frame about the count of co-occurences
df['series_1_in_series_2'] = df['series_1'].apply(lambda x: df['series_2'].tolist().count(x))
df.head()

   series_1  series_2  difference  series_1_in_series_2
0     10055     10568         513                     0
1     10069     10743         674                     0
2     10158     11109         951                     0
3     10237     11134         897                     0
4     10354     11428        1074                     0

In [ ]:
# Enhance about the similarity score
df['similarity'] = df['series_1'] * df['series_1_in_series_2']
df.head()

   series_1  series_2  difference  series_1_in_series_2  similarity
0     10055     10568         513                     0           0
1     10069     10743         674                     0           0
2     10158     11109         951                     0           0
3     10237     11134         897                     0           0
4     10354     11428        1074                     0           0

In [8]:
# Solution part 2
print(df['similarity'].sum())

26593248